app/Controllers/AuthController.php

INSERT INTO `user` (`username`, `password`, `email`) VALUES ('joni', '202cb962ac59075b964b07152d234b70', 'jonikecil@mail.com')
---
			public function register()
			{
				if ($this->request->getPost()) {
					$username = $this->request->getVar('username');
					$password = md5($this->request->getVar('password'));
					$email = $this->request->getVar('email');

					$data = [
						'username' => $username,
						'password' => $password,
						'email' => $email
					];

					$this->user->insert($data);