app/Controllers/TransaksiController.php

INSERT INTO `transaksi` (`username`, `total_harga`, `alamat`, `ongkir`, `status`, `created_by`, `created_date`) VALUES ('jo', '259000', 'semarang', '9000', 0, 'jo', '2023-06-22 09:09:12')
---
        public function buy()
        {
            if($this->request->getPost())
            {
                $data = $this->request->getPost();

                $transaksiModel = new \App\Models\TransaksiModel();
                $transaksiDetailModel = new \App\Models\TransaksiDetailModel();

                $dataForm = [
                    'username' => $this->request->getPost('username'),
                    'total_harga' => $this->request->getPost('total_harga'),
                    'alamat' => $this->request->getPost('alamat'),
                    'ongkir' => $this->request->getPost('ongkir'),
                    'status' => 0,
                    'created_by' => $this->request->getPost('username'),
                    'created_date' => date("Y-m-d H:i:s")
                ];

                $transaksiModel->insert($dataForm);

INSERT INTO `transaksi_detail` (`id_transaksi`, `id_barang`, `jumlah`, `diskon`, `subtotal_harga`, `created_by`, `created_date`) VALUES (2, '1', 1, 0, 100000, 'jo', '2023-06-22 09:09:12')
---
                        'created_date' => date("Y-m-d H:i:s")
                    ];

                    $transaksiDetailModel->insert($dataFormDetail);

SELECT *
FROM `transaksi`
---
			public function index()
			{
				$data['transaksi'] = $this->transaksi->findAll();

UPDATE `transaksi` SET `status` = '2'
WHERE `transaksi`.`id` IN ('7)')
---
            public function edit($id)
			{
				$data = $this->request->getPost();

				if($data){
                    if($data){
                            $dataForm = [
                                'status' => $this -> request -> getPost('status')
                            ];
					$this->transaksi->update($id, $dataForm);